


[shiv_m1 X2CharacterTemplate]
strCharacterName="Xcom Shiv"

[shiv_m2 X2CharacterTemplate]
strCharacterName="Xcom Alloy Shiv"

[SHIV_tesla X2CharacterTemplate]
strCharacterName="Tesla Spike"

[shivmissitem X2WeaponTemplate]
FriendlyName="Shiv Secondary"
BriefSummary="Shiv Secondary"
LongDescription="Shiv Secondary"
TacticalText="<Bullet/> Shiv Secondary"


[shivgrapitem X2WeaponTemplate]
FriendlyName="Shiv Secondary"
BriefSummary="Shiv Secondary"
LongDescription="Shiv Secondary"
TacticalText="<Bullet/> Shiv Secondary"

[shivstandardshot X2AbilityTemplate]
LocFriendlyName="Standard Shot"
LocLongDescription="Fire your weapon at the target."
LocHelpText="Fire your weapon at the target."
LocFlyOverText="Standard Shot"
LocPromotionPopupText="Fire your weapon at the target."

[Country_fbshiv X2CountryTemplate]
+DisplayName = "shiv"
+DisplayNameWithArticle = "shiv"
+DisplayNameWithArticleLower = "shiv"
+DisplayNamePossessive = "shiv"
+DisplayAdjective = "shiv"

[fbnamer2]
fbSparkFirstName="LightShiv-"
fbSparkLastNamePrefix="000"

[fbnamer3]
fbSparkFirstName="AlloyShiv-"
fbSparkLastNamePrefix="000"

[PlatedShivArmor_Schematic X2SchematicTemplate]
m_strClassLabel="SHIV"
[PoweredShivArmor_Schematic X2SchematicTemplate]
m_strClassLabel="SHIV"



[shivgun_MG_Schematic X2SchematicTemplate]
m_strClassLabel="SHIV"
[shivgun_BM_Schematic X2SchematicTemplate]
m_strClassLabel="SHIV"

[Cannon_SHIV_M1 X2WeaponTemplate]
FriendlyName="Shiv cannon"
FriendlyNamePlural="Shiv cannons"
BriefSummary="Shiv cannon."
LongDescription="Shiv cannon"
TacticalText="Shiv cannon."
AbilityDescName="Shiv Cannon"

[Cannon_SHIV_M2 X2WeaponTemplate]
FriendlyName="Shiv Cannon MK2"
FriendlyNamePlural="Shiv Cannon MK2's"
BriefSummary="Shiv Cannon MK2"
LongDescription="Shiv Cannon MK2"
TacticalText="Shiv Cannon MK2"
AbilityDescName="Shiv Cannon MK2"

[Cannon_SHIV_M3 X2WeaponTemplate]
FriendlyName="Shiv Cannon MK3"
FriendlyNamePlural="Shiv Cannon MK3's"
BriefSummary="Shiv Cannon MK3"
LongDescription="Shiv Cannon MK3"
TacticalText="Shiv Cannon MK3"
AbilityDescName="Shiv Cannon MK3"
































[intshiv X2TechTemplate]
DisplayName="Build Light Shiv"
Summary="Build a robotic shiv unit. The S.H.I.V. (Super Heavy Infantry Vehicle) is a weapons platform that can be manufactured in the proving grounds. S.H.I.V.s can be deployed as substitutes for human soldiers on missions and require a space in the XCOM HQ barracks."
CodeName="Shiv"
LongDescription="The S.H.I.V. (Super Heavy Infantry Vehicle) is a weapons platform that can be manufactured in the proving grounds. S.H.I.V.s can be deployed as substitutes for human soldiers on missions and require a space in the XCOM HQ barracks." 
UnlockedDescription="A light shiv has been built"



[intshiv2 X2TechTemplate]
DisplayName="Build Alloy Shiv"
Summary="Build a robotic alloy shiv unit. The Alloy S.H.I.V. is a weapon platform that can be manufactured in the proving grounds. It is an variant model of the standard S.H.I.V., with superior armor and the capacity to serve as mobile cover for soldiers."
CodeName="Shiv"
LongDescription="Build a robotic alloy shiv unit. The Alloy S.H.I.V. is a weapon platform that can be manufactured in the proving grounds. It is an variant model of the standard S.H.I.V., with superior armor and the capacity to serve as mobile cover for soldiers."
UnlockedDescription="A alloy shiv has been built"



[fbshivclass X2SoldierClassTemplate]
+DisplayName = "Xcom Light Shiv"
+ClassSummary = "The S.H.I.V. (Super Heavy Infantry Vehicle) is a weapons platform that can be manufactured in the proving grounds. S.H.I.V.s can be deployed as substitutes for human soldiers on missions and require a space in the XCOM HQ barracks."
+LeftAbilityTreeTitle = "Light Shiv"
+RightAbilityTreeTitle = "Light Shiv"

[fbshivclass2 X2SoldierClassTemplate]
+DisplayName = "Xcom Alloy Shiv"
+ClassSummary = "The Alloy S.H.I.V. is a weapon platform that can be manufactured in the proving grounds. It is an variant model of the standard S.H.I.V., with superior armor and the capacity to serve as mobile cover for soldiers."
+LeftAbilityTreeTitle = "Alloy Shiv"
+RightAbilityTreeTitle = "Alloy Shiv"




[Cannon_fake1 X2WeaponTemplate]
FriendlyName="Shiv Cannon MK2"
FriendlyNamePlural="Shiv Cannon MK2's"
BriefSummary="This will upgrade the shivs damage output on their primary weapon"
LongDescription="This will upgrade the shivs damage output on their primary weapon"
TacticalText="This will upgrade the shivs damage output on their primary weapon"
AbilityDescName="Shiv Cannon MK2"


[Cannon_fake2 X2WeaponTemplate]
FriendlyName="Shiv Cannon MK3"
FriendlyNamePlural="Shiv Cannon MK3's"
BriefSummary="This will upgrade the shivs damage output on their primary weapon"
LongDescription="This will upgrade the shivs damage output on their primary weapon"
TacticalText="This will upgrade the shivs damage output on their primary weapon"
AbilityDescName="Shiv Cannon MK3"




[TargetDefinitionshiv X2AbilityTemplate]
LocFriendlyName="Target Definition"
LocLongDescription="Any unit seen by a shiv remains permanently visible."
LocHelpText="Any unit seen by a shiv remains permanently visible."
LocPromotionPopupText="<Bullet/> Scouting with the shiv will allow enemies to be tracked even if they enter the fog of war.<br/>"

[TargetDefinitionPassiveshiv X2AbilityTemplate]
LocFriendlyName="Target Definition"
LocLongDescription="Any unit seen by a shiv remains permanently visible."
LocHelpText="Any unit seen by a shiv remains permanently visible."






[SHIV_M1Immunities X2AbilityTemplate]
LocFriendlyName="Shiv immunities"
LocLongDescription="The shiv is incapable of being mentally minipulated."
LocHelpText="The shiv is incapable of being mentally minipulated."
LocFlyOverText="The shiv is incapable of being mentally minipulated."
LocPromotionPopupText="The shiv is incapable of being mentally minipulated."

[shivflush X2AbilityTemplate]
LocFriendlyName="Incapacitating Shot"
LocLongDescription="Take an easy to hit,low damage shot at an enemy, having a chance to knock them back out of cover."
LocHelpText="Take an easy to hit,low damage shot at an enemy, having a chance to knock them back out of cover."
LocFlyOverText="Incapacitating Shot"
LocPromotionPopupText="Take an easy to hit,low damage shot at an enemy, having a chance to knock them back out of cover."




[shivshielden X2AbilityTemplate]
LocFriendlyName="Energy Shield"
LocLongDescription="Gives the shiv a 3hp regenerating shield which refills at the start of your turn."
LocHelpText="Gives the shiv a 3hp regenerating shield which refills at the start of your turn."
LocFlyOverText="Shield"
LocPromotionPopupText="Gives the shiv a 3hp regenerating shield which refills at the start of your turn."

[shivtrishot X2AbilityTemplate]
LocFriendlyName="Firestorm Cannon"
LocLongDescription="Take 3 standard shots at once at a target at the cost of overheating and damaging the shiv."
LocHelpText="Take 3 standard shots at once at a target at the cost of overheating and damaging the shiv."
LocFlyOverText="Firestorm Cannon"
LocPromotionPopupText="Take 3 standard shots at once at a target at the cost of overheating and damaging the shiv."

[shivdamagecontrol X2AbilityTemplate]
LocFriendlyName="Damage Control"
LocLongDescription="Once the shiv unit is damaged it will temporarilly strengthen its armor by 3 points, Boosting its protection against subsequent attacks for the remainder of the turn."
LocHelpText="Once the shiv unit is damaged it will temporarilly strengthen its armor by 3 points, Boosting its protection against subsequent attacks for the remainder of the turn."
LocFlyOverText="Damage Control"
LocPromotionPopupText="Once the shiv unit is damaged it will temporarilly strengthen its armor by 3 points, Boosting its protection against subsequent attacks for the remainder of the turn."

[barrageStrike X2AbilityTemplate]
LocFriendlyName="Javalin Strike"
LocLongDescription="Launch a long range barrage of missles up into the air. The missles then come crashing down to the target location on the next turn, dealing massive damage to all enemies still within the target area."
LocHelpText="Launch a long range barrage of missles up into the air. The missles then come crashing down to the target location on the next turn, dealing massive damage to all enemies still within the target area."
LocFlyOverText="Javalin Strike"
LocPromotionPopupText="Launch a long range barrage of missles up into the aie. The missles then come crashing down to the target location on the next turn, dealing massive damage to all enemies still within the target area."

[barrageStrike2 X2AbilityTemplate]
LocFriendlyName="Javalin Strike"
LocLongDescription="Launch a long range barrage of missles up into the sky. The missles then come crashing down to the target location on the next turn, dealing massive damage to all enemies still within the target area."
LocHelpText="Launch a long range barrage of missles up into the sky. The missles then come crashing down to the target location on the next turn, dealing massive damage to all enemies still within the target area."
LocFlyOverText="Javalin Strike"
LocPromotionPopupText="Launch a long range barrage of missles up into the sky. The missles then come crashing down to the target location on the next turn, dealing massive damage to all enemies still within the target area."

[shivimmolate X2AbilityTemplate]
LocFriendlyName="Immolating Barrage"
LocLongDescription="Ignite your projectiles and cause a small fiery explosion at the target location, dealing a small amount of initial damage followed by a burning effect"
LocHelpText="Ignite your projectiles and cause a small fiery explosion at the target location, dealing a small amount of initial damage followed by a burning effect"
LocFlyOverText="Immolating Barrage"
LocPromotionPopupText="Ignite your projectiles and cause a small fiery explosion at the target location, dealing a small amount of initial damage followed by a burning effect"

[shivjustice X2AbilityTemplate]
LocFriendlyName="Grappling Shot"
LocLongDescription="Shoot out a grappling hook at an enemy target and pull them in next to the shiv. Costs only 1 action"
LocHelpText="Shoot out a grappling hook at an enemy target and pull them in next to the shiv. Costs only 1 action"
LocFlyOverText="Grappling Shot"
LocPromotionPopupText="Shoot out a grappling hook at an enemy target and pull them in next to the shiv. Costs only 1 action"

[shivshield X2AbilityTemplate]
LocFriendlyName="Kinetic Barrier"
LocLongDescription="Creates a shield that lasts 1 turn,blocking all damage. Costs only 1 action to engage."
LocHelpText="Creates a shield that lasts 1 turn,blocking all damage. Costs only 1 action to engage."
LocFlyOverText="Kinetic Barrier"
LocPromotionPopupText="Creates a shield that lasts 1 turn,blocking all damage. Costs only 1 action to engage."



[teslaattack X2AbilityTemplate]
LocFriendlyName="Tesla Attack"
LocLongDescription="Unleash an electrical attack in an area around the shiv. Causing a high amount of armor piercing damage."
LocHelpText="Unleash an electrical attack in an area around the shiv. Causing a high amount of armor piercing damage."
LocFlyOverText="Tesla Attack"
LocPromotionPopupText="Unleash an electrical attack in an area around the shiv. Causing a high amount of armor piercing damage."

[teslalaunch X2AbilityTemplate]
LocFriendlyName="Deploy Tesla Spike"
LocLongDescription="Launch 3 deployable tesla spikes onto the battlefield that act as persistent mines that damage any enemies who get near. Once hit, that particular enemy unit is immune to subsequent strikes from other teslas for 1 turn. Advent will also attempt to destroy these if spotted."
LocHelpText="Launch 3 deployable tesla spikes onto the battlefield that act as persistent mines that damage any enemies who get near. Once hit, that particular enemy unit is immune to subsequent strikes from other teslas for 1 turn. Advent will also attempt to destroy these if spotted."
LocFlyOverText="Deploy Tesla Spike"
LocPromotionPopupText="Launch 3 deployable tesla spikes onto the battlefield that act as persistent mines that damage any enemies who get near. Once hit, that particular enemy unit is immune to subsequent strikes from other teslas for 1 turn. Advent will also attempt to destroy these if spotted."







[shivmodule2 X2AbilityTemplate]
LocFriendlyName="Additional Armor"
LocLongDescription="Gives the shiv an additional armor point"
LocHelpText="Gives the shiv an additional armor point"
LocFlyOverText="Additional Armor"
LocPromotionPopupText="Gives the shiv an additional armor point"

[shivmodule1 X2AbilityTemplate]
LocFriendlyName="Javalin Strike"
LocLongDescription="Launch a long range barrage of missles up into the sky. The missles then come crashing down to the target location on the next turn, dealing massive damage to all enemies still within the target area. This ability has can only be used twice per mission."
LocHelpText="Launch a long range barrage of missles up into the sky. The missles then come crashing down to the target location on the next turn, dealing massive damage to all enemies still within the target area. This ability has can only be used twice per mission."
LocFlyOverText="Javalin Strike"
LocPromotionPopupText="Launch a long range barrage of missles up into the sky. The missles then come crashing down to the target location on the next turn, dealing massive damage to all enemies still within the target area. This ability has can only be used twice per mission."



[Bladestormfb33z X2AbilityTemplate]
LocFriendlyName="Automated Turret"
LocLongDescription="The shiv will take reaction shots at any enemy that enters within close proximity to the unit"
LocHelpText="The shiv will take reaction shots at any enemy that enters within close proximity to the unit"
LocFlyOverText="Automated Turret"
LocPromotionPopupText="The shiv will take reaction shots at any enemy that enters within close proximity to the unit"

[BladestormAttackfb33z X2AbilityTemplate]
LocFriendlyName="Automated Turret"
LocLongDescription="The shiv will take reaction shots at any enemy that enters within close proximity to the unit"
LocHelpText="The shiv will take reaction shots at any enemy that enters within close proximity to the unit"
LocFlyOverText="Automated Turret"
LocPromotionPopupText="The shiv will take reaction shots at any enemy that enters within close proximity to the unit"





















[shivArmor X2ArmorTemplate]
FriendlyName="Shiv Defense Systems"
FriendlyNamePlural="Shiv Defense Systems"
BriefSummary="This is the shivs default armor."
TacticalText="<Bullet/> This is the shivs default armor."


[PlatedshivArmor X2ArmorTemplate]
FriendlyName="Shiv Defense Systems Mk2"
FriendlyNamePlural="Shiv Defense Systems Mk2"
BriefSummary="This is the shivs upgraded armor."
TacticalText="<Bullet/> This is the shivs upgraded armor."


[PoweredshivArmor X2ArmorTemplate]
FriendlyName="Shiv Defense Systems Mk3"
FriendlyNamePlural="Shiv Defense Systems Mk3"
BriefSummary="This is the shivs upgraded armor."
TacticalText="<Bullet/> This is the shivs upgraded armor."


[PlatedshivArmorfake X2ArmorTemplate]
FriendlyName="Shiv Defense Systems Mk2"
FriendlyNamePlural="Shiv Defense Systems Mk2"
BriefSummary="This will upgrade all shivs defensive systems, increasing the armor and health of the units."
TacticalText="<Bullet/> This will upgrade all shivs defensive systems, increasing the armor and health of the units."


[PoweredshivArmorfake X2ArmorTemplate]
FriendlyName="Shiv Defense Systems Mk3"
FriendlyNamePlural="Shiv Defense Systems Mk3"
BriefSummary="This will upgrade all shivs defensive systems, increasing the armor and health of the units."
TacticalText="<Bullet/> This will upgrade all shivs defensive systems, increasing the armor and health of the units."










[teleportshiv X2AbilityTemplate]
LocFriendlyName="Shiv Launch"
LocLongDescription="Move anywhere on the battlefield in a single turn. Launch cannot be used indoors. This ability has a 7 turn cooldown."
LocHelpText="Move anywhere on the battlefield in a single turn. Launch cannot be used indoors. This ability has a 7 turn cooldown."
LocFlyOverText="Shiv Launch"
LocPromotionPopupText="Move anywhere on the battlefield in a single turn. Launch cannot be used indoors. This ability has a 7 turn cooldown."


[shivBulwark X2AbilityTemplate]
LocFriendlyName="Bulwark"
LocLongDescription="Gain a bonus point of Armor, and always provide high cover to all adjacent squadmates."
LocHelpText="Gain a bonus point of Armor, and always provide high cover to all adjacent squadmates."
LocPromotionPopupText="<Bullet/> Bulwark adds one point of Armor.<br/><Bullet/> Any squadmate standing adjacent to the SHIV will gain the high cover Defense bonus.<br/>"
